neohung/stm32_examples/Task-04-USBTEST-StdPeriphDriver-FreeRTOS/src/usb_bsp_neo.c
}

static uint8_t  *USBD_neo_GetCfgDesc (uint8_t speed, uint16_t *length)
{
//	printf("--------------------\r\n");
//  printf("USBD_neo_GetCfgDesc\r\n");
//	printf("--------------------\r\n");

  *length = sizeof (usbd_neo_CfgDesc);
  return usbd_neo_CfgDesc;
}


typedef enum {
  USBD_OK   = 0,
  USBD_BUSY,
  USBD_FAIL,
}USBD_Status;

typedef struct _CDC_IF_PROP
{
  uint16_t (*pIf_Init)     (void);
  uint16_t (*pIf_DeInit)   (void);
  uint16_t (*pIf_Ctrl)     (uint32_t Cmd, uint8_t* Buf, uint32_t Len);
  uint16_t (*pIf_DataTx)   (uint8_t* Buf, uint32_t Len);
  uint16_t (*pIf_DataRx)   (uint8_t* Buf, uint32_t Len);
}
CDC_IF_Prop_TypeDef;
static uint16_t VCP_Init(void);
static uint16_t VCP_DeInit(void);
static uint16_t VCP_Ctrl(uint32_t Cmd, uint8_t* Buf, uint32_t Len);
uint16_t VCP_DataTx(uint8_t* Buf, uint32_t Len);
static uint16_t VCP_DataRx(uint8_t* Buf, uint32_t Len);
CDC_IF_Prop_TypeDef VCP_fops = { VCP_Init, VCP_DeInit, VCP_Ctrl, VCP_DataTx, VCP_DataRx };
#define APP_FOPS                        VCP_fops


__ALIGN_BEGIN uint8_t CmdBuff[CDC_CMD_PACKET_SZE] __ALIGN_END ;
static uint32_t cdcCmd = 0xFF;
static uint32_t cdcLen = 0;
static uint8_t  usbd_neo_Setup (void  *pdev,USB_SETUP_REQ *req)
{
	//printf("--------------------\r\n");
	//printf("usbd_neo_Setup, (req->bmRequest & USB_REQ_TYPE_MASK)=%d\r\n",(req->bmRequest & USB_REQ_TYPE_MASK));
	//printf("--------------------\r\n");
	 uint16_t len;
	  uint8_t  *pbuf;
	  switch (req->bmRequest & USB_REQ_TYPE_MASK)
	  {
	 	    /* CDC Class Requests -------------------------------*/
	 	  case USB_REQ_TYPE_CLASS :
	 	  {
	 		 if (req->wLength)
	 		 {
	 		 // printf("Check if the request is a data setup packet\r\n");
	 		    /* Check if the request is Host-to-Device requeset */
             //----------------
	 		   if (req->bmRequest & 0x80){
	 		 	  //printf("request is Host-to-Device requeset, call VCP_Ctrl()\r\n");
	 		 	  APP_FOPS.pIf_Ctrl(req->bRequest, CmdBuff, req->wLength);
	 		 	  USBD_CtlSendData (pdev, CmdBuff, req->wLength);
	 		   }else{  /* Device-to-Host requeset */
	 		 	// printf("request is Device-to-Host\r\n");
	 		     cdcCmd = req->bRequest;
	 		 	 cdcLen = req->wLength;
	 	         USBD_CtlPrepareRx (pdev,CmdBuff,req->wLength);
	 		   }
	 		 //----------------
	 	     }else{
	 			 /* No Data request */
	 			 //printf("No Data request, CALL VCP_Ctrl\r\n");
	 			 APP_FOPS.pIf_Ctrl(req->bRequest, NULL, 0);
	 	     }
	 	   }
	 	   return USBD_OK;
	 	  default:
	 	      USBD_CtlError (pdev, req);
	 	      return USBD_FAIL;
	 	    // Standard Requests -------------------------------
	 	  case USB_REQ_TYPE_STANDARD:
	 	      break;
	 }
	  return USBD_OK;
}

static uint8_t  usbd_neo_EP0_RxReady (void  *pdev)
{
	//printf("--------------------\r\n");
	//printf("usbd_neo_EP0_RxReady\r\n");
	//printf("--------------------\r\n");
}


static uint8_t  usbd_neo_DataOut (void *pdev, uint8_t epnum)
{
	//printf("--------------------\r\n");
	//	printf("usbd_neo_DataOut\r\n");
	//	printf("--------------------\r\n");
		uint16_t USB_Rx_Cnt;
		  USB_Rx_Cnt = ((USB_OTG_CORE_HANDLE*)pdev)->dev.out_ep[epnum].xfer_count;
		  //Call VCP_DataRx()
		  APP_FOPS.pIf_DataRx(USB_Rx_Buffer, USB_Rx_Cnt);
		  DCD_EP_PrepareRx(pdev,
		                   CDC_OUT_EP,
		                   (uint8_t*)(USB_Rx_Buffer),
		                   CDC_DATA_OUT_PACKET_SIZE);
		  return USBD_OK;
}

__ALIGN_BEGIN uint8_t APP_Rx_Buffer   [APP_RX_DATA_SIZE] __ALIGN_END ;
uint32_t APP_Rx_ptr_in  = 0; //HEAD
uint32_t APP_Rx_ptr_out = 0; //TAIL
uint32_t APP_Rx_length  = 0;

uint8_t  USB_Tx_State = 0;

static uint8_t  usbd_neo_DataIn (void *pdev, uint8_t epnum)
{
	printf("--------------------\r\n");
		printf("usbd_neo_DataIn\r\n");
		printf("--------------------\r\n");
		 uint16_t USB_Tx_ptr;
		  uint16_t USB_Tx_length;

		  if (USB_Tx_State == 1)
		  {
		    if (APP_Rx_length == 0)
		    {
		    	//Reset USB_Tx_State to 0
		      USB_Tx_State = 0;
		    }
		    else
		    {
		      if (APP_Rx_length > CDC_DATA_IN_PACKET_SIZE){
		        USB_Tx_ptr = APP_Rx_ptr_out;
		        USB_Tx_length = CDC_DATA_IN_PACKET_SIZE;

		        APP_Rx_ptr_out += CDC_DATA_IN_PACKET_SIZE;
		        APP_Rx_length -= CDC_DATA_IN_PACKET_SIZE;
		      }
		      else
		      {
		        USB_Tx_ptr = APP_Rx_ptr_out;
		        USB_Tx_length = APP_Rx_length;

		        APP_Rx_ptr_out += APP_Rx_length;
		        APP_Rx_length = 0;
		      }

		      /* Prepare the available data buffer to be sent on IN endpoint */
		      DCD_EP_Tx (pdev,
		                 CDC_IN_EP,
		                 (uint8_t*)&APP_Rx_Buffer[USB_Tx_ptr],
		                 USB_Tx_length);
		    }
		  }

		  return USBD_OK;


}


static void Handle_USBAsynchXfer (void *pdev)
{
  uint16_t USB_Tx_ptr;
  uint16_t USB_Tx_length;
  //printf("Handle_USBAsynchXfer USB_Tx_State=%d[%d/%d]\r\n",USB_Tx_State,APP_Rx_ptr_out,APP_Rx_ptr_in);
  if(USB_Tx_State != 1){
    if (APP_Rx_ptr_out == APP_RX_DATA_SIZE){
      APP_Rx_ptr_out = 0;
    }

    if(APP_Rx_ptr_out == APP_Rx_ptr_in){
      USB_Tx_State = 0;
      return;
    }

    if(APP_Rx_ptr_out > APP_Rx_ptr_in) /* rollback */{
      APP_Rx_length = APP_RX_DATA_SIZE - APP_Rx_ptr_out;
    }
    else{
      APP_Rx_length = APP_Rx_ptr_in - APP_Rx_ptr_out;
    }
    if (APP_Rx_length > CDC_DATA_IN_PACKET_SIZE){
      USB_Tx_ptr = APP_Rx_ptr_out;
      USB_Tx_length = CDC_DATA_IN_PACKET_SIZE;
      APP_Rx_ptr_out += CDC_DATA_IN_PACKET_SIZE;
      APP_Rx_length -= CDC_DATA_IN_PACKET_SIZE;
    }
    else{
      USB_Tx_ptr = APP_Rx_ptr_out;
      USB_Tx_length = APP_Rx_length;
      APP_Rx_ptr_out += APP_Rx_length;
      APP_Rx_length = 0;
    }
    USB_Tx_State = 1;
    //printf("Handle_USBAsynchXfer send DCD_EP_Tx\r\n");
    DCD_EP_Tx (pdev,
               CDC_IN_EP,
               (uint8_t*)&APP_Rx_Buffer[USB_Tx_ptr],
               USB_Tx_length);
  }

}


static uint8_t  usbd_neo_SOF (void *pdev)
{
	//printf("--------------------\r\n");
	//	printf("usbd_neo_SOF\r\n");
		//printf("--------------------\r\n");
		static uint32_t FrameCount = 0;
		  if (FrameCount++ == CDC_IN_FRAME_INTERVAL)
		  {
		    /* Reset the frame counter */
		    FrameCount = 0;
		    /* Check the data to be sent through IN pipe */
		    Handle_USBAsynchXfer(pdev);
		  }
		  return USBD_OK;
}


