neohung/stm32_examples/Task-04-USBTEST-StdPeriphDriver-FreeRTOS/src/usb_bsp_neo.c
static uint16_t VCP_Init(void)
{
	//printf("VCP_Init\r\n");
}
static uint16_t VCP_DeInit(void)
{
	//printf("VCP_DeInit\r\n");
}

#define SEND_ENCAPSULATED_COMMAND               0x00
#define GET_ENCAPSULATED_RESPONSE               0x01
#define SET_COMM_FEATURE                        0x02
#define GET_COMM_FEATURE                        0x03
#define CLEAR_COMM_FEATURE                      0x04
#define SET_LINE_CODING                         0x20
#define GET_LINE_CODING                         0x21
#define SET_CONTROL_LINE_STATE                  0x22
#define SEND_BREAK                              0x23
#define NO_CMD                                  0xFF

typedef struct
{
  uint32_t bitrate;
  uint8_t  format;
  uint8_t  paritytype;
  uint8_t  datatype;
}LINE_CODING;

LINE_CODING linecoding = {
		115200, /* baud rate*/
		0x00, /* stop bits-1*/
		0x00, /* parity - none*/
		0x08 /* nb. of bits 8*/
};


static uint16_t VCP_Ctrl(uint32_t Cmd, uint8_t* Buf, uint32_t Len) {
	//printf("VCP_Ctrl: cmd=0x%x\r\n",Cmd);
	switch (Cmd) {
	case SEND_ENCAPSULATED_COMMAND:
		/* Not  needed for this driver */
		break;

	case GET_ENCAPSULATED_RESPONSE:
		/* Not  needed for this driver */
		break;

	case SET_COMM_FEATURE:
		/* Not  needed for this driver */
		break;

	case GET_COMM_FEATURE:
		/* Not  needed for this driver */
		break;

	case CLEAR_COMM_FEATURE:
		/* Not  needed for this driver */
		break;

	case SET_LINE_CODING:
		/* Not  needed for this driver */
		break;

	case GET_LINE_CODING:
		Buf[0] = (uint8_t) (linecoding.bitrate);
		Buf[1] = (uint8_t) (linecoding.bitrate >> 8);
		Buf[2] = (uint8_t) (linecoding.bitrate >> 16);
		Buf[3] = (uint8_t) (linecoding.bitrate >> 24);
		Buf[4] = linecoding.format;
		Buf[5] = linecoding.paritytype;
		Buf[6] = linecoding.datatype;
		break;

	case SET_CONTROL_LINE_STATE:
		/* Not  needed for this driver */
		break;

	case SEND_BREAK:
		/* Not  needed for this driver */
		break;

	default:
		break;
	}

	return USBD_OK;
}

uint16_t VCP_DataTx(uint8_t* Buf, uint32_t Len)
{
	//printf("VCP_DataTx\r\n");
	uint32_t i = 0;
		while (i < Len) {
			APP_Rx_Buffer[APP_Rx_ptr_in] = *(Buf + i);
			APP_Rx_ptr_in++;
			i++;
			/* To avoid buffer overflow */
			if (APP_Rx_ptr_in == APP_RX_DATA_SIZE) {
				APP_Rx_ptr_in = 0;
			}
		}

		return USBD_OK;
}

void VCP_put_char(uint8_t buf) {
	VCP_DataTx(&buf, 1);
}

#define APP_TX_BUF_SIZE 128
uint8_t APP_Tx_Buffer[APP_TX_BUF_SIZE];
uint32_t APP_tx_ptr_head;
uint32_t APP_tx_ptr_tail;

static uint16_t VCP_DataRx(uint8_t* Buf, uint32_t Len)
{
	//printf("VCP_DataRx\r\n");
	uint32_t i;

		for (i = 0; i < Len; i++) {
			APP_Tx_Buffer[APP_tx_ptr_head] = *(Buf + i);
			//printf("VCP_DataRx: Got data %c\r\n", *(Buf + i));
			//Read data into buffer HEAD++,
			APP_tx_ptr_head++;

			if (APP_tx_ptr_head == APP_TX_BUF_SIZE)
				APP_tx_ptr_head = 0;

			if (APP_tx_ptr_head == APP_tx_ptr_tail)
				return USBD_FAIL;
		}

		return USBD_OK;
}

int VCP_get_char(uint8_t *buf) {
	if (APP_tx_ptr_head == APP_tx_ptr_tail)
		return 0;

	*buf = APP_Tx_Buffer[APP_tx_ptr_tail];
	printf("VCP_get_char: '%c'\r\n",*buf);
	APP_tx_ptr_tail++;
	if (APP_tx_ptr_tail == APP_TX_BUF_SIZE)
		APP_tx_ptr_tail = 0;

	return 1;
}

static uint8_t  usbd_neo_DeInit (void  *pdev, uint8_t cfgidx)
{
  /* Open EP IN */
  DCD_EP_Close(pdev,
              CDC_IN_EP);

  /* Open EP OUT */
  DCD_EP_Close(pdev,
              CDC_OUT_EP);

  /* Open Command IN EP */
  DCD_EP_Close(pdev,
              CDC_CMD_EP);

  /* Restore default state of the Interface physical components */
  APP_FOPS.pIf_DeInit();

  return USBD_OK;
}

USBD_Class_cb_TypeDef  USBD_neo_cb =
{
  usbd_neo_Init,
  usbd_neo_DeInit,
  usbd_neo_Setup,
  0,//NULL,                 /* EP0_TxSent, */
  usbd_neo_EP0_RxReady,
  usbd_neo_DataIn,
  usbd_neo_DataOut,
  usbd_neo_SOF,
  0,//NULL,
  0,//NULL,
  USBD_neo_GetCfgDesc,
};

void USBD_USR_DeviceConfigured (void)
{
}


void USBD_USR_DeviceConnected (void)
{
}

void USBD_USR_DeviceDisconnected (void)
{
}

USBD_Usr_cb_TypeDef USR_cb =
{
  USBD_USR_Init,
  USBD_USR_DeviceReset,
  USBD_USR_DeviceConfigured,
  USBD_USR_DeviceSuspended,
  USBD_USR_DeviceResumed,
  USBD_USR_DeviceConnected,
  USBD_USR_DeviceDisconnected,
};
/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
